Mahmoud-geberty/stm32-voice-controlled-robot/Core/Src/main.c
	/* Buffers used to store input and output tensors */
	AI_ALIGNED(4) ai_float in_data[AI_SPEECH_COMMANDS_MODEL_IN_1_SIZE_BYTES];
	AI_ALIGNED(4) ai_float out_data[AI_SPEECH_COMMANDS_MODEL_OUT_1_SIZE_BYTES];

	/* Pointer to the neural network model */
	ai_handle speech_commands_model = AI_HANDLE_NULL;

	/* Initialize wrapper structs that hold info about the data (tensor height, width, channels) */
	ai_buffer ai_input[AI_SPEECH_COMMANDS_MODEL_IN_NUM] =
			AI_SPEECH_COMMANDS_MODEL_IN;
	ai_buffer ai_output[AI_SPEECH_COMMANDS_MODEL_OUT_NUM] =
			AI_SPEECH_COMMANDS_MODEL_OUT;

	/* Allocate memory and get weights from the neural network model */
	ai_network_params ai_params =
			AI_NETWORK_PARAMS_INIT(
					AI_SPEECH_COMMANDS_MODEL_DATA_WEIGHTS(ai_speech_commands_model_data_weights_get()),
					AI_SPEECH_COMMANDS_MODEL_DATA_ACTIVATIONS(activations)
			);

	/* Set wrapper structs pointers to the data buffers */
	ai_input[0].n_batches = 1;
	ai_input[0].data = AI_HANDLE_PTR(in_data);
	ai_output[0].n_batches = 1;
	ai_output[0].data = AI_HANDLE_PTR(out_data);

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* Initialize LEDs */
	BSP_LED_Init(LED3);
	BSP_LED_Init(LED4);
	BSP_LED_Init(LED5);
	BSP_LED_Init(LED6);

	preprocessing_init();

	execution_time_init();

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* Initialize button */
	BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_EXTI);

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_I2S2_Init();
	MX_CRC_Init();
	MX_PDM2PCM_Init();
	MX_USART2_UART_Init();
	MX_I2C1_Init();
	MX_SPI1_Init();
	MX_I2C3_Init();
	MX_TIM6_Init();

	SysInit();

	/* USER CODE BEGIN 2 */

	/* Create an instance of the neural network */
	ai_err = ai_speech_commands_model_create(&speech_commands_model,
			AI_SPEECH_COMMANDS_MODEL_DATA_CONFIG);
	if (ai_err.type != AI_ERROR_NONE) {
		usart_buffer_length = sprintf(usart_buffer,
				"Error: could not create NN instance\r\n");
		HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer, usart_buffer_length,
				100);
		while (1)
			;
	}

	/* Initialize the neural network */
	if (!ai_speech_commands_model_init(speech_commands_model, &ai_params)) {
		usart_buffer_length = sprintf(usart_buffer,
				"Error: could not initialize NN\r\n");
		HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer, usart_buffer_length,
				100);
		while (1)
			;
	}

	unsigned char rx_buff = 'a';
	start = HAL_GetTick();


	while (1) {

		switch (robotState) {
		case ROBOT_WALK:
			robot_walk();
			break;
		case ROBOT_STOP:
			robot_stop();
			break;
		case ROBOT_UP:
			robot_up();
			break;
		case ROBOT_DOWN:
			robot_sit();
			break;
		default: robot_stop();
		}


		HAL_UART_Receive(&huart2, &rx_buff, 1, 1);

		if (rx_buff != 'a') {
			rx_buff = 'a';
			usart_buffer_length = sprintf(usart_buffer,
					"we're in!!\r\n");
			HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
					usart_buffer_length, 100);
			/* Acquire audio signal and transform it to PCM data */
			audio_record();

			/* Preprocess audio signal to get the MFCCs */
			preprocess_audio((int16_t*) &pcm_buffer[0], (ai_float*) &in_data[0],
					PCM_BUFFER_SIZE);

			/* Perform inference */
			nbatch = ai_speech_commands_model_run(speech_commands_model,
					&ai_input[0], &ai_output[0]);

			if (nbatch != 1) {
				usart_buffer_length = sprintf(usart_buffer,
						"Error: could not run inference\r\n");
				HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
						usart_buffer_length, 100);
			} else {
				/* Get the predicted word */
				uint8_t idx = argmax(out_data, AI_SPEECH_COMMANDS_MODEL_OUT_1_SIZE);
				char *word = get_word(idx);
				recognize_commands(word);
			}
		}
	}

	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */
	/* USER CODE END 3 */
}

void robot_walk(void) {
	if (HAL_GetTick() - start >= 200) {
		start = HAL_GetTick();
		switch(stage){
		case 0:
			height = 0.14;
			x_distance = 0.0;
			stage = 1;
			break;
		case 1:
			height = 0.14;
			x_distance = 0.02;
			stage = 2;
			break;
		case 2:
			height = 0.16;
			x_distance = 0.02;
			stage = 3;
			break;
		case 3:
			height = 0.16;
			x_distance = -0.02;
			stage = 4;
			break;
		case 4:
			height = 0.14;
			x_distance = -0.02;
			stage = 0;
			break;
		}
		//		ServoDriverSetPWM(&servodriver, FLHip, MAP_Angle2Pulse(legFL.des_hip_angle,144.0,0.0,FLHipmin,FLHipmax),0);
		//		ServoDriverSetPWM(&servodriver, FLKnee, MAP_Angle2Pulse(legFL.des_knee_angle,23.0,97.0,FLKneemin,FLKneemax),0);
	}
}

void robot_stop(void) {
	height = 0.14;
	x_distance = 0;
}

void robot_up(void) {
	height = 0.19;
	x_distance = 0;
}

void robot_sit(void) {
	height = 0.10;
	x_distance = 0;
}

/**
 * @brief Recognize specific vocal commands.
 *   This function performs the following actions depending on the predicted
 *   word:
 *      - `ON` -> enable words display
 *      - `OFF` -> disable words display
 *      - `VISUAL` -> show execution time statistics
 *      - `STOP` -> reset execution time statistics
 *      - `ONE` -> turn the green led on
 *      - `TWO` -> turn the blue led on
 *      - `THREE` -> turn the red led on
 *      - `FOUR` -> turn the orange led on
 *
 *   The following rules apply to the above commands:
 *      - `ON` command has no effect when `display_words_enabled` is true
 *      - `OFF` command has no effect when `display_words_enabled` is false
 *      - `VISUAL` and `STOP` commands will always have effect
 *      - the LEDs will always turn off unless their commands are pronounced
 *
 * @param  word*   a constant string to be recognized
 *
 * @retval None
 */
void recognize_commands(const char *word) {
	/* Turn on green led and turn off the others */
	if (strcmp(word, GO) == 0) {
		robotState = ROBOT_WALK;
		/* Turn on blue led and turn off the others */
	} else if (strcmp(word, UP) == 0) {
		robotState = ROBOT_UP;
		/* Turn on red led and turn off the others */
	} else if (strcmp(word, DOWN) == 0) {
		robotState = ROBOT_DOWN;
		/* Turn on orange led and turn off the others */
	} else if (strcmp(word, STOP) == 0) {
		robotState = ROBOT_STOP;
	}

	usart_buffer_length = sprintf(usart_buffer,
			"%s\r\n", word);
	HAL_UART_Transmit(&huart2, (uint8_t*) usart_buffer,
			usart_buffer_length, 100);
}

static void MX_I2C3_Init(void)
{

